# Version 1.0
# Author: marina.unuchak
# Date: 31.01.2023
# 4) Дано натуральное пятизначное число. Найдите сумму его цифр.
i = 30
while i > 0:
    print("Marina")
    i -= 1
